/* 
  Localizable.strings
  RunCat

  Created by Takuto Nakamura on 2021/08/08.
  
*/

"support" = "サポートページ\n";
"url" = "https://kyome.io/runcat/index.html";
"urlQueryLang" = "%@?lang=ja";
"urlQueryLangHelp" = "%@?lang=ja#self_made";
"urlQueryLangPlugins" = "%@?lang=ja#plugins";

// Mail
"issueReport" = "不具合の報告";
"environment" = "# 環境\n- %@: ver %@\n- macOS: %@\n";
"whatYouTried" = "# 試したこと\n- アプリの再起動: はい/いいえ\n- ランナーストアにて購入の復元: はい/いいえ\n";
"shortDescription" = "# 不具合の簡単な説明\n\n";
"reproduceIssue" = "# 不具合の再現手順（不具合が発生した際に行なっていた操作）\n\n";
"expectedResult" = "# 本来期待される挙動\n\n";

// Main Menu
"systemInfo" = "システム情報";
"runner" = "ランナー";
"runnersStore" = "ランナーストア…";
"preferences" = "環境設定…";
"activityMonitor" = "アクティビティモニタを開く";
"aboutApp" = "RunCatについて";
"acknowledgments" = "謝辞";
"reportIssue" = "不具合の報告";
"quitApp" = "RunCatを終了";

// System Info
"temperature" = "温度: %4.1f°C";

// CPU
"cpu" = "CPU: %4.1f%%";
"system" = "システム: %4.1f%%";
"user" = "ユーザ: %4.1f%%";
"idle" = "アイドル状態: %4.1f%%";

// Memory
"memory" = "メモリ: %4.1f%%";
"pressure" = "プレッシャー: %4.1f%%";
"app" = "アプリケーション: %4.1f GB";
"wired" = "確保: %4.1f GB";
"compressed" = "圧縮: %4.1f GB";

// Battery
"batteryIsNotInstalled" = "バッテリー: 非搭載";
"battery" = "バッテリー: %5.1f%%";
"powerSource" = "供給源: %@";
"health" = "ヘルス: %5.1f%%";
"maxCapacity" = "最大容量: %5.1f%%";
"cycle" = "充放電回数: %d";

// Disk
"disk" = "ディスク: %4.1f%% 使用中";

// Network
"network" = "ネットワーク: %@";
"noConnection" = "接続なし";
"localIp" = "ローカルIP: %@";
"upload" = "上り: %@";
"download" = "下り: %@";
"unknown" = "不明";

// Self-Made
"selfMadeError" = "自作ランナー読み込みエラー";
"fileBroken" = "このランナーのデータは壊れています。再度登録し直してください。";

// Stop Runner
"stopRunnerMessage" = "本当にランナーを停止しても良いですか？";
"stopRunnerInfo" = "ランナーを停止してしまうと本アプリの独自性が失われます。";
"changedMyMind" = "気が変わった";
"stop" = "停止する";

// Store & IAP Notify
"storeOpenError" = "現在ストアを利用できません。";
"cannotPayment" = "支払いができません。";
"someTrouble" = "コンピューターがインターネットに接続されていないか、ストアのサーバーに障害が発生している可能性があります。";
"storeNotification" = "RunCat: ランナーストア";
"finishPurchase" = "購入手続き完了";
"funTime" = "楽しい時間をお過ごしください！";
"finishRestore" = "購入履歴から復元完了";
"checkState" = "購入状態を確認してください。";
"failedRestore" = "購入履歴から復元失敗";
"failedPurchase" = "購入手続き失敗";
"neverPurchase" = "少なくとも1つのアイテムを事前に購入する必要があります。";
"contactText" = "サポートが必要な場合は、https://support.apple.com/ja-jp/apps からApp Storeサポートにお問い合わせください。";

// Store Item
"allRunnerDescription" = "特別カラー版のランナーは含まれません。";
"colorDescription" = "特別カラー版のランナー: 開発者への支援。";
"unlockedDescription" = "自作ランナー登録機能のロックを解除。";
"purchase" = "購入";
"purchased" = "購入済み";
"restore" = "購入履歴から復元";
"do" = "実行";

// Registration
"addImage" = "PNGファイルを選択してください。";
"registrationError" = "ランナー登録エラー";
"addImage" = "アップロードされた画像 FILE_NAME は制約に違反しています。";
"over100" = "100枚以上の画像を用いることはできません。";
"nameConflict" = "この名前はすでに使用されています。別の名前を使用してください。";
"registerFailed" = "登録に失敗しました。";
"loadingImageError" = "画像読み込みエラー";
"onlyPNG" = "使用可能なフォーマットはPNGのみです。";
"lockSelfMadeError" = "登録機能はロックされています。";
"mustBuy" = "ランナーストアで自作ランナー登録機能を購入してください。";

// Bug Support
"recommendMessage" = "現在ランナーを停止する設定が有効になっています。";
"recommendInfo" = "意図していない場合は、お手数ですが環境設定にてランナーを停止する設定を無効にしてください。ご不便をおかけして申し訳ありません。";

// Runner Name
"cat"            = "ネコ α";
"b.cat"          = "ネコ β";
"c.cat"          = "ネコ γ";
"tail.cat"       = "猫のしっぽ";
"cat.nyan.mock"  = "Nyan Catもどき";
"parrot"         = "例のオウム";
"human"          = "ヒト";
"up.push"        = "腕立て伏せ";
"up.sit"         = "腹筋";
"duck.rubber"    = "お風呂のアヒル";
"city"           = "都会";
"sausage"        = "踊るソーセージ";
"dots"           = "ドット";
"reactor"        = "彼のリアクター";
"slime"          = "スライム";
"fishman"        = "魚男";
"sheep"          = "ヒツジ";
"sushi.rotating" = "回転寿司";
"people.party"   = "パリピ";
"dogeza"         = "土下座";
    
"cheetah"       = "チーター";
"dog"           = "イヌ";
"puppy"         = "子犬";
"rabbit"        = "ウサギ";
"frog"          = "カエル";
"bird"          = "トリ";
"penguin"       = "ペンギン";
"dolphin"       = "イルカ";
"dragon"        = "ドラゴン";
"owl"           = "フクロウ";
"dinosaur"      = "恐竜";
"terrier"       = "テリア犬";
"hedgehog"      = "ハリネズミ";
"horse"         = "早馬";
"penguin2"      = "ペンギン２";
"wheel.hamster" = "ハムスターと回し車";
"octopus"       = "タコ";
"chameleon"     = "カメレオン";
"chicken"       = "ニワトリ";
"mouse"         = "ネズミ";
"pig"           = "ブタ";
"fox"           = "キツネ";
"whale"         = "クジラ";
"otter"         = "カワウソ";
"squirrel"      = "リス";
"butterfly"     = "蝶々";
"greyhound"     = "グレイハウンド";
"corgi.welsh"   = "ウェルシュ・コーギー";
    
"cogwheel"         = "歯車";
"bonfire"          = "焚き火";
"drop"             = "水滴";
"rocket"           = "ロケット";
"pendulum"         = "振り子";
"cradle"           = "ニュートンのゆりかご";
"curve.sine"       = "サイン波";
"pulse"            = "パルス";
"coffee"           = "コーヒー";
"locomotive.steam" = "蒸気機関車";
"drink.tapioca"    = "タピオカ ドリンク";
"frypan"           = "フライパン";
"factory"          = "工場";
"engine"           = "エンジン";
"earth"            = "地球";

"sleigh.reindeer"   = "トナカイとソリ";
"snowman"           = "雪だるま";
"chime.wind"        = "風鈴";
"sparkler"          = "線香花火";
"lantern.o.jack"    = "ジャック・オー・ランタン";
"ghost"             = "幽霊";
"mochi"             = "おもち";

"runners.all"       = "全ランナー開放";
"cat.golden"        = "黄金のネコ";
"cat.cluster.metal" = "メタルクラスタキャット";
"cat.flash"         = "赤い閃光猫";
"neko.maneki"       = "招き猫";
"sushi"             = "お寿司";
"cat.gaming"        = "ゲーミング・ネコ";
"parrot.party"      = "虹色のオウム";
"uhooi"             = "ウホーイ";
"made.self"         = "自作ランナー登録機能";
